app/controllers/comments_controller.rb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", 18]]
---
  def new
    @photo = Photo.find params[:photo_id]

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "comments" ("comment", "photo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comment", "Nice pic!"], ["photo_id", 12], ["created_at", "2015-06-21 00:41:05.268407"], ["updated_at", "2015-06-21 00:41:05.268407"]]
---
  def create
   @photo = Photo.find(params[:photo_id])
   @photo.comments.create(comment_params)