app/controllers/photos_controller.rb

  def create
    Photo.create(photo_params)
---
INSERT INTO "photos" ("title", "caption", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Test title"], ["caption", "Test caption"], ["created_at", "2015-06-20 20:38:47.862652"], ["updated_at", "2015-06-20 20:38:47.862652"]]